%XPSOUND  MATLAB の音声機能のデモ
%
%   MATLAB は、オーディオデータを調べるのに役立ちます。音声は、1 次元の配列、
%   またはベクトルと考えられます。
%
%   このウィンドウを使って、音声を選択し、音声データをグラフィカルに表示する
%   ことができます。コンピュータが音声機能を持っている場合、音声を再生したり、
%   音量を選択できます。
%
%   3 種類の方法で、音声をグラフィカルに表示することができます。
%
%   時系列は、時間の関数としてデータの 2 次元プロットです。
%
%   パワースペクトル密度 (PSD) は、音声の長さに対する信号の周波数成分の
%   分布です。与えられた周波数帯域全体の PSD の積分は、そのような周波数帯
%   全体の信号の平均パワーを計算します。
%
%   スペクトログラムは、時間の関数として信号の周波数成分を見るものです。
%   時間は左から右へと増加し、周波数は下から上へと増加します。
%
%   (パワースペクトル密度とスペクトログラムのオプションは、Signal Processing 
%   Toolbox が必要であることに注意してください)


%   Copyright 1984-2007 The MathWorks, Inc.
